------------------------------------------------------------
-----------------以下参数请勿更改-----------------------------
------------------------------------------------------------
local norecoil = false
local click = false
function OnEvent(event, arg)
	OutputLogMessage("event = %s, arg = %d\n", event, arg)
        EnablePrimaryMouseButtonEvents(true)
------------------------------------------------------------
-----------------以上参数请勿更改-----------------------------
------------------------------------------------------------

-------------前言---------------------------------------
-----因本人水平有限，而且没有认真学习过。
-----所以可能编出来的很乱或者可以更精简一些。
-------------注意事项------------------------------------
----如果发现开启后按住左键或者single键后鼠标只移动一下的情况，请把罗技软件退出并用管理员方式启动。
----想修改热键之类的参数的话基本我都绿字注释了。
--------------------------------------------------------

-------------键鼠热键切换-------------------------------------
HOTKEY = "G_PRESSED"
----如果想使用鼠标键触发请把"G_PRESSED"改为"MOUSE_BUTTON_PRESSED"
----双引号也要带
------------------------------------------------------------

-------------半自动开火键-------------------------------------
single = 8----开火键（鼠标G键，默认8为G8既G502左键旁边俩键前边那个键）
------------------------------------------------------------

-------------开关热键----------------------------------------
off = 6----关闭
mod1 = 1----通用设置
mod2 = 2----只有左键连发（比如光头要用？）
---mod3 = 3----参数3
---mod4 = 4----参数4
---mod5 = 5----参数5
----想修改为其他罗技键盘按键直接改数字即可
----如果需要更多参数，根据需要自行删除"mod3""mod4""mod5"前边的“---”并修改对应的压枪参数即可
----使用多个参数的时候容易记混当前参数几都是什么的时候，可以自行修改对应参数后边绿字以作备注
----不知道对应键数字是几的话，按一下按键并看下方信息框中“arg=”后边对应的数字。
------------------------------------------------------------

----------------------------------------------
-------------mod参数调节-----------------------
----------------------------------------------
----如需更多参数有动手能力的修改开启
----没有的话也不要担心，帖子里我有进行说明
----如果只需要如mod2那样的只有左键连发，把全自动的设置为0即可。
----如无特殊情况，全自动的参数请勿修改。
---------mod1---------------
if (event == HOTKEY and arg == mod1) then
		norecoil = true
		OutputLogMessage("norecoil mod1\n")
	-------全自动---------
	zyx = 3
	xzy = 5
	yxz = 10
	-------半自动---------
	yzx = 5----压枪强度
	zzz = 150----开火延迟
end
---------mod2---------------
if (event == HOTKEY and arg == mod2) then
		norecoil = true
		OutputLogMessage("norecoil mod2\n")
	-------全自动---------
	zyx = 0
	xzy = 0
	yxz = 0
	-------半自动---------
	yzx = 5----压枪强度
	zzz = 150----开火延迟
end
---------mod3---------------
if (event == HOTKEY and arg == mod3) then
		norecoil = true
		OutputLogMessage("norecoil mod3\n")
	-------全自动---------
	zyx = 3
	xzy = 5
	yxz = 10
	-------半自动---------
	yzx = 5----压枪强度
	zzz = 150----开火延迟
end
---------mod4---------------
if (event == HOTKEY and arg == mod4) then
		norecoil = true
		OutputLogMessage("norecoil mod4\n")
	-------全自动---------
	zyx = 3
	xzy = 5
	yxz = 10
	-------半自动---------
	yzx = 5----压枪强度
	zzz = 150----开火延迟
end
---------mod5---------------
if (event == HOTKEY and arg == mod5) then
		norecoil = true
		OutputLogMessage("norecoil mod5\n")
	-------全自动---------
	zyx = 3
	xzy = 5
	yxz = 10
	-------半自动---------
	yzx = 5----压枪强度
	zzz = 150----开火延迟
end
----------------------------------------------
----------------------------------------------
----------------------------------------------





































------------------------------------------------------------
------------------------------------------------------------
-----------------以下参数请勿修改-----------------------------
------------------------------------------------------------
------------------------------------------------------------

----------------------------------------------
-------------no recoil------------------------
----------------------------------------------
if (event == "MOUSE_BUTTON_PRESSED" and arg == 1 and norecoil and IsMouseButtonPressed(3) and not IsModifierPressed("lalt")) then
	Sleep(10)
	repeat
		MoveMouseRelative(zyx, xzy)
		Sleep(yxz)
		MoveMouseRelative(-zyx, -xzy)
		Sleep(yxz)
	until not IsMouseButtonPressed(1)
end
----------------------------------------------
--------------single--------------------------
----------------------------------------------
if (event == "MOUSE_BUTTON_PRESSED" and arg == single and norecoil) then
	PressMouseButton(1)
	Sleep(20)
	ReleaseMouseButton(1)
	MoveMouseRelative(0, yzx)
	Sleep(zzz)
	click = true
	SetMKeyState(3)
end

if (event == "MOUSE_BUTTON_RELEASED" and arg == single) then
	click = false
end

if (event == "M_RELEASED" and arg == 3 and click) then
	PressMouseButton(1)
	Sleep(20)
	ReleaseMouseButton(1)
	MoveMouseRelative(0, yzx)
	Sleep(zzz)
		if click then
			SetMKeyState(3)
		end
end
----------------------------------------------
--------------mouse---------------------------
----------------------------------------------
if (event == HOTKEY and arg == off) then
		norecoil = false
		OutputLogMessage("norecoil off\n")
end
----------------------------------------------
----------------------------------------------
----------------------------------------------
end